*** Get ulfm docker image
#+begin_src sh :session ulfm :results output :exports both 
ULFMREP=/tmp/ulfm
mkdir $ULFMREP
cd $ULFMREP
wget http://fault-tolerance.org/downloads/docker-ftmpi.sc16tutorial.tar.xz
tar xf docker-ftmpi.sc16tutorial.tar.xz 
#+end_src

 #+results:
 #+begin_example

$ $ --2017-03-30 19:23:18--  http://fault-tolerance.org/downloads/docker-ftmpi.sc16tutorial.tar.xz
Résolution de fault-tolerance.org (fault-tolerance.org)… 160.36.131.221
Connexion à fault-tolerance.org (fault-tolerance.org)|160.36.131.221|:80… connecté.
requête HTTP transmise, en attente de la réponse… 200 OK
Taille : 39673176 (38M) [application/x-tar]
Sauvegarde en : « docker-ftmpi.sc16tutorial.tar.xz »
[                    ]       0  --.-KB/s                        docker-ftm   0%[                    ]  43,55K   183KB/s                       docker-ftmp   0%[                    ] 172,23K   361KB/s                      docker-ftmpi   1%[                    ] 554,03K   775KB/s                     docker-ftmpi.   4%[                    ]   1,64M  1,72MB/s                    docker-ftmpi.s   9%[>                   ]   3,56M  3,09MB/s                   docker-ftmpi.sc  15%[==>                 ]   5,78M  4,27MB/s                  docker-ftmpi.sc1  19%[==>                 ]   7,53M  4,84MB/s                 docker-ftmpi.sc16  21%[===>                ]   8,21M  4,66MB/s                docker-ftmpi.sc16t  22%[===>                ]   8,64M  4,41MB/s               docker-ftmpi.sc16tu  25%[====>               ]   9,79M  4,53MB/s               ocker-ftmpi.sc16tut  31%[=====>              ]  12,00M  5,08MB/s               cker-ftmpi.sc16tuto  37%[======>             ]  14,21M  5,55MB/s               ker-ftmpi.sc16tutor  43%[=======>            ]  16,45M  5,96MB/s               er-ftmpi.sc16tutori  49%[========>           ]  18,59M  6,28MB/s               r-ftmpi.sc16tutoria  55%[==========>         ]  20,83M  6,59MB/s    eta 3s     -ftmpi.sc16tutorial  60%[===========>        ]  23,08M  6,87MB/s    eta 3s     ftmpi.sc16tutorial.  66%[============>       ]  25,31M  7,60MB/s    eta 3s     tmpi.sc16tutorial.t  72%[=============>      ]  27,56M  8,34MB/s    eta 3s     mpi.sc16tutorial.ta  78%[==============>     ]  29,81M  9,20MB/s    eta 3s     pi.sc16tutorial.tar  84%[===============>    ]  31,93M  9,40MB/s    eta 1s     i.sc16tutorial.tar.  90%[=================>  ]  34,18M  9,53MB/s    eta 1s     .sc16tutorial.tar.x  96%[==================> ]  36,42M  9,52MB/s    eta 1s     docker-ftmpi.sc16tu 100%[===================>]  37,83M  9,79MB/s    in 4,7s    

2017-03-30 19:23:22 (8,07 MB/s) — « docker-ftmpi.sc16tutorial.tar.xz » sauvegardé [39673176/39673176]
 #+end_example
 
